perf-tests/CORE/mdms/mdms.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="mdms" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Http URL/API Test" enabled="true">
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">25000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2500</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">0</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="Cookie Manager" enabled="true">
          <collectionProp name="CookieManager.cookies"/>
          <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
        </CookieManager>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="URL Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="qa" elementType="Argument">
              <stringProp name="Argument.name">qa</stringProp>
              <stringProp name="Argument.value">qa.digit.org</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="uat" elementType="Argument">
              <stringProp name="Argument.name">uat</stringProp>
              <stringProp name="Argument.value">uat.digit.org</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${qa}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers"/>
        </HeaderManager>
        <hashTree/>
        <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell PreProcessor" enabled="true">
          <boolProp name="resetInterpreter">false</boolProp>
          <stringProp name="script">URL url = sampler.getUrl();

vars.put(&quot;host&quot;, String.valueOf(url.getHost()));
var gethost = vars.get(&quot;host&quot;);
log.info(&quot;starting&quot;);
log.info(&quot;host is &quot; + gethost);
switch (gethost)
{
case &quot;${qa}&quot;:
    vars.put(&quot;state&quot;, &quot;${qastate}&quot;);
    vars.put(&quot;tenantId&quot;, &quot;${qatenantid}&quot;);
    vars.put(&quot;username&quot;, &quot;${qausername}&quot;);
   
    break;
case &quot;${uat}&quot;:
    vars.put(&quot;state&quot;, &quot;${uatstate}&quot;);
    vars.put(&quot;tenantId&quot;, &quot;${uattenantid}&quot;);
    vars.put(&quot;username&quot;, &quot;${uatusername}&quot;);
    
    break;    
} 
</stringProp>
        </BeanShellPreProcessor>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="password" elementType="Argument">
              <stringProp name="Argument.name">password</stringProp>
              <stringProp name="Argument.value">eGov@123</stringProp>
              <stringProp name="Argument.desc">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="---------------------------------------------------------------" elementType="Argument">
              <stringProp name="Argument.name">---------------------------------------------------------------</stringProp>
              <stringProp name="Argument.value">---------------------------------------------------------------</stringProp>
              <stringProp name="Argument.desc">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="qastate" elementType="Argument">
              <stringProp name="Argument.name">qastate</stringProp>
              <stringProp name="Argument.value">pb</stringProp>
              <stringProp name="Argument.desc">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="qatenantid" elementType="Argument">
              <stringProp name="Argument.name">qatenantid</stringProp>
              <stringProp name="Argument.value">pb.amritsar</stringProp>
              <stringProp name="Argument.desc">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="qausername" elementType="Argument">
              <stringProp name="Argument.name">qausername</stringProp>
              <stringProp name="Argument.value">LATANAIK</stringProp>
              <stringProp name="Argument.desc">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="---------------------------------------------------------------" elementType="Argument">
              <stringProp name="Argument.name">---------------------------------------------------------------</stringProp>
              <stringProp name="Argument.value">---------------------------------------------------------------</stringProp>
              <stringProp name="Argument.desc">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="uatstate" elementType="Argument">
              <stringProp name="Argument.name">uatstate</stringProp>
              <stringProp name="Argument.value">pg</stringProp>
              <stringProp name="Argument.desc">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="uatusername" elementType="Argument">
              <stringProp name="Argument.name">uatusername</stringProp>
              <stringProp name="Argument.value">LATA001</stringProp>
              <stringProp name="Argument.desc">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="uattenantid" elementType="Argument">
              <stringProp name="Argument.name">uattenantid</stringProp>
              <stringProp name="Argument.value">pg.citya</stringProp>
              <stringProp name="Argument.desc">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="---------------------------------------------------------------" elementType="Argument">
              <stringProp name="Argument.name">---------------------------------------------------------------</stringProp>
              <stringProp name="Argument.value">---------------------------------------------------------------</stringProp>
              <stringProp name="Argument.desc">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="/user/oauth/token?_=1653313980703-11" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="username" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">username</stringProp>
                <stringProp name="Argument.value">${username}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="password" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">password</stringProp>
                <stringProp name="Argument.value">${password}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="userType" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">userType</stringProp>
                <stringProp name="Argument.value">EMPLOYEE</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="tenantId" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">tenantId</stringProp>
                <stringProp name="Argument.value">${tenantId}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="scope" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">scope</stringProp>
                <stringProp name="Argument.value">read</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="grant_type" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">grant_type</stringProp>
                <stringProp name="Argument.value">password</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.path">/user/oauth/token?_=1653313980703</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Sec-Fetch-Mode" elementType="Header">
                <stringProp name="Header.name">Sec-Fetch-Mode</stringProp>
                <stringProp name="Header.value">cors</stringProp>
              </elementProp>
              <elementProp name="Referer" elementType="Header">
                <stringProp name="Header.name">Referer</stringProp>
                <stringProp name="Header.value">https://uat.digit.org/digit-ui/employee/user/login?from=%2Fdigit-ui%2Femployee</stringProp>
              </elementProp>
              <elementProp name="Sec-Fetch-Site" elementType="Header">
                <stringProp name="Header.name">Sec-Fetch-Site</stringProp>
                <stringProp name="Header.value">same-origin</stringProp>
              </elementProp>
              <elementProp name="Accept-Language" elementType="Header">
                <stringProp name="Header.name">Accept-Language</stringProp>
                <stringProp name="Header.value">en-US,en;q=0.5</stringProp>
              </elementProp>
              <elementProp name="Origin" elementType="Header">
                <stringProp name="Header.name">Origin</stringProp>
                <stringProp name="Header.value">https://uat.digit.org</stringProp>
              </elementProp>
              <elementProp name="Accept" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json, text/plain, */*</stringProp>
              </elementProp>
              <elementProp name="authorization" elementType="Header">
                <stringProp name="Header.name">authorization</stringProp>
                <stringProp name="Header.value">Basic ZWdvdi11c2VyLWNsaWVudDo=</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/x-www-form-urlencoded</stringProp>
              </elementProp>
              <elementProp name="Accept-Encoding" elementType="Header">
                <stringProp name="Header.name">Accept-Encoding</stringProp>
                <stringProp name="Header.value">gzip, deflate, br</stringProp>
              </elementProp>
              <elementProp name="User-Agent" elementType="Header">
                <stringProp name="Header.name">User-Agent</stringProp>
                <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:100.0) Gecko/20100101 Firefox/100.0</stringProp>
              </elementProp>
              <elementProp name="Sec-Fetch-Dest" elementType="Header">
                <stringProp name="Header.name">Sec-Fetch-Dest</stringProp>
                <stringProp name="Header.value">empty</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="access_token" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">access_token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.access_token</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="mdms/_search" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;RequestInfo&quot;: {&#xd;
        &quot;apiId&quot;: &quot;asset-services&quot;,&#xd;
        &quot;ver&quot;: null,&#xd;
        &quot;ts&quot;: null,&#xd;
        &quot;action&quot;: null,&#xd;
        &quot;did&quot;: null,&#xd;
        &quot;key&quot;: null,&#xd;
        &quot;msgId&quot;: &quot;search with from and to values&quot;,&#xd;
        &quot;authToken&quot;: &quot;${access_token}&quot;&#xd;
    },&#xd;
    &quot;MdmsCriteria&quot;: {&#xd;
        &quot;tenantId&quot;: &quot;${state}&quot;,&#xd;
        &quot;moduleDetails&quot;: [&#xd;
            {&#xd;
                &quot;moduleName&quot;: &quot;common-masters&quot;,&#xd;
                &quot;masterDetails&quot;: [&#xd;
                    {&#xd;
                        &quot;name&quot;: &quot;GenderType&quot;&#xd;
                    }&#xd;
                ]&#xd;
            }&#xd;
        ]&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.path">/egov-mdms-service/v1/_search</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="mdms/_search" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="mdms/_search" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
 &quot;RequestInfo&quot;: {&#xd;
   &quot;apiId&quot;: &quot;asset-services&quot;,&#xd;
   &quot;ver&quot;: null,&#xd;
   &quot;ts&quot;: null,&#xd;
   &quot;action&quot;: null,&#xd;
   &quot;did&quot;: null,&#xd;
   &quot;key&quot;: null,&#xd;
   &quot;msgId&quot;: &quot;search with from and to values&quot;,&#xd;
   &quot;authToken&quot;: &quot;${access_token}&quot;&#xd;
 },&#xd;
 &quot;MdmsCriteria&quot;: {&#xd;
   &quot;tenantId&quot;:  &quot;${state}&quot;,&#xd;
   &quot;moduleDetails&quot;: [&#xd;
     {&#xd;
       &quot;moduleName&quot;: &quot;BillingService&quot;,&#xd;
       &quot;masterDetails&quot;: [&#xd;
         {&#xd;
           &quot;name&quot;: &quot;TaxHeadMaster&quot;&#xd;
         }&#xd;
       ]&#xd;
     }&#xd;
   ]&#xd;
 }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.path">/egov-mdms-service/v1/_search</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="mdms/_search" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="mdms/_search" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;RequestInfo&quot;: {&#xd;
        &quot;apiId&quot;: &quot;asset-services&quot;,&#xd;
        &quot;ver&quot;: null,&#xd;
        &quot;ts&quot;: null,&#xd;
        &quot;action&quot;: null,&#xd;
        &quot;did&quot;: null,&#xd;
        &quot;key&quot;: null,&#xd;
        &quot;msgId&quot;: &quot;search with from and to values&quot;,&#xd;
        &quot;authToken&quot;: &quot;${access_token}&quot;&#xd;
    },&#xd;
    &quot;MdmsCriteria&quot;: {&#xd;
        &quot;tenantId&quot;: &quot;${state}&quot;,&#xd;
        &quot;moduleDetails&quot;: [&#xd;
            {&#xd;
                &quot;moduleName&quot;: &quot;common-masters&quot;,&#xd;
                &quot;masterDetails&quot;: [&#xd;
                    {&#xd;
                        &quot;name&quot;: &quot;Department&quot;&#xd;
                    },&#xd;
                    {&#xd;
                        &quot;name&quot;: &quot;Designation&quot;&#xd;
                    },&#xd;
                    {&#xd;
                        &quot;name&quot;: &quot;StateInfo&quot;&#xd;
                    },&#xd;
                    {&#xd;
                        &quot;name&quot;: &quot;wfSlaConfig&quot;&#xd;
                    },&#xd;
                    {&#xd;
                        &quot;name&quot;: &quot;uiHomePage&quot;&#xd;
                    }&#xd;
                ]&#xd;
            },&#xd;
            {&#xd;
                &quot;moduleName&quot;: &quot;tenant&quot;,&#xd;
                &quot;masterDetails&quot;: [&#xd;
                    {&#xd;
                        &quot;name&quot;: &quot;tenants&quot;&#xd;
                    },&#xd;
                    {&#xd;
                        &quot;name&quot;: &quot;citymodule&quot;&#xd;
                    }&#xd;
                ]&#xd;
            },&#xd;
            {&#xd;
                &quot;moduleName&quot;: &quot;DIGIT-UI&quot;,&#xd;
                &quot;masterDetails&quot;: [&#xd;
                    {&#xd;
                        &quot;name&quot;: &quot;ApiCachingSettings&quot;&#xd;
                    }&#xd;
                ]&#xd;
            }&#xd;
        ]&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.path">/egov-mdms-service/v1/_search</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="mdms/_search" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/home/user/apache-jmeter-5.3/result.csv</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>